{
  "home": {
    "title": "Inicio",
    "description": "Soy un desarrollador centrado en aplicaciones para móviles, apasionado de la tecnología y el código limpio. Me encanta aprender y seguir formandome y mejorando tanto personal como profesionalmente.",
    "goToExp": "Mas detalles de mi conocimiento <1>en la segunda pestaña</1>",
    "goToContact": "Si quieres contactarme <1>en la tercera pestaña puedes ver algunas formas</1>",
    "goToSetings": "Si quieres personalizar esto <1>en la última pestaña puedes verlo</1>"
  },
  "experience": {
    "title": "Experiencia",
    "description": "Cosas en las que he trabajado o he estudiado.",

    "knowledge": {
      "title": "Conocimientos",
      "fields": [
        {
          "title": "JavaScript",
          "description": " Incluyendo React (y React Context), Node, React Native, Redux (redux thunk y redux saga), GraphQL."
        },
        {
          "title": "HTML5 and CSS3",
          "description": "conocimiento de Bootstrap, Styled Components, Foundation y SASS"
        },
        {
          "title": "Base de datos",
          "description": "MySQL, OracleSQL y MongoDB, para la app para móviles También he trabajado con RealmDB, WatermelonDB y Realtime Database de Firebase"
        },
        {
          "title": "Git",
          "description": "Control de versiones con git, con uso de comandos y programas como Sourcetree y extensiones como Git Graph"
        },
        {
          "title": "Trabajo en equipo y comunicación",
          "description": "Uso de tecnologías Agile (principalmente Kanban pero también Scrum). Uso de herramientas como Jira o Trello"
        },
        {
          "title": "Otras tecnologías con conocimiento menor",
          "description": "PHP7, Java, ASP.NET (Umbraco como CMS), Python (Django)."
        }
      ]
    },

    "workExperience": {
      "title": "Experiencia laboral",
      "fields": [
        {
          "title": "Desarrollador React native en Multisafepay",
          "subTitle": "Noviembre 2021 – presente",
          "description": "- Desarrollo y distribución de aplicaciones para Android e iOS usando React Native Expo incluyendo librarias nativas\n- Trabajo en múltiples aplicaciones incluyendo una palicacion para POS y para envio yrecogida de pedidos para restauurantes\n-Control de errores con Sentry\n-trabajo usando metodologías Agile, Kanban"
        },
        {
          "title": "Desarrollador React native en Aluxion Labs",
          "subTitle": "Marzo 2018 – Noviembre 2021",
          "description": "- Desarrollo y distribución de aplicaciones para Android e iOS usando React Native (incluyendo el uso de código nativo con ObjectiveC/SWIFT en iOS y Java/Kotlin en Android) y Expo,\n- Trabajo en múltiples aplicaciones, incluidas las aplicaciones de Fintech (inversiones y recomendaciones) y salud (seguros de salud, administración de usuarios de centros de salud).\n- Desarrollo de una aplicación de apoyo para iWatch en Swift.\n- Uso de integración continua con App Center.\n- Configuración y uso de tecnologías y librerías como notificaciones push (con Firsebase), Google Maps, Analytics (Firebase Analytics, Previosly Google Analytics).\n- El trabajo usando metodologías Agile, como Scrumm y Kanban."
        },
        {
          "title": "Desarrollador Fullstack en IDITIC Software",
          "subTitle": "Marzo 2017 – Junio 2017",
          "description": "- Desarrollado una aplicación móvil para la gestión de almacenamiento con React Native.\n- Trabajado con con NEXTJS como backend para páginas web hechas con React.\n- Parcialmente realizado servidor para un servicio de streming de karaoke usando Django como back-end y Amazon Cloudfront para el almacenamiento."
        },
        {
          "title": "Desarrollador Fullstack en Vizioz",
          "subTitle": "Marzo 2016 – Junio  2016",
          "description": "- Trabajado en la migración de un blog de WordPress a un Umbraco CMS (un CMS open source de ASP.NET) y asegúrese de la visualización correcta de las imágenes.\n- Desarrollo de frontEnd utilizando SASS como CSS precompilado y Foundation."
        }
      ]
    },
    "education": {
      "title": "Estudios",
      "fields": [
        {
          "title": "Ciclo formativo Grado superior en Desarrollo de Aplicaciones Multiplataforma",
          "subTitle": "2016 – 2018",
          "description": "IES Fernando Aguilar quignon - Conocimiento sobre el desarrollo de programas de escritorios y aplicaciones para android usando hilos y procesos y manejando datos de forma local y en linea."
        },
        {
          "title": "Ciclo formativo Grado superior en Desarrollo de Aplicaciones web",
          "subTitle": "2016 – 2018",
          "description": "IES Francisco Ayala - Especialización en desarrollo front-end (html5, CSS3 y Javascript) además de desarrollo back-end (NodeJS y PHP). Aprendido a usar bases de datos SQL (MySQL/MariadDB y OracleSQL) y NoSQL (MongoDB)."
        },
        {
          "title": "Bachelor of Pharmacy",
          "subTitle": "2011 – 2014",
          "description": "Universidad de Granada"
        }
      ]
    }
  },
  "contact": {
    "title": "Contacto",
    "description": "Puedes encontrarme de estas formas:"
  },
  "settings": {
    "title": "Ajustes",
    "description": "¿Otro idioma? ¿Demasiado claro? ¿Tienes curiosidad sobre comó está hecha? Las respuestas aquí abajo:",

    "language": "Idioma",
    "spanish": "Español",
    "english": "Inglés",
    "darkTheme": "Tema oscuro",
    "interestLinks": "Enlaces de interes",
    "linkToWeb": "Enlace a la <1>versión Web</1>",
    "linkToApp": "Enlace a la <1>App</1>",
    "linkToExpo": "Enlace a la <1>App de Expo</1>",
    "linkToSource": "Enlace al <1>código fuente</1>"
  },
  "addToClipboard": "Pulsa aquí para copiar, en caso de que el botón no funcione",
  "addedToClipboard": "Copiado"
}
